In [1]:
import numpy as np
import pandas as pd

In [2]:
zomato=pd.read_csv('Zomato.csv',sep=',')
zomato

,Restaurant_Name,Dining_Rating,Delivery_Rating,Dining_Votes,Delivery_Votes,Cuisine,Place_Name,City,Item_Name,Best_Seller,...,Is_Bestseller,Restaurant_Popularity,Avg_Rating_Restaurant,Avg_Price_Restaurant,Avg_Rating_Cuisine,Avg_Price_Cuisine,Avg_Rating_City,Avg_Price_City,Is_Highly_Rated,Is_Expensive
0,Doner King,3.9,4.2,39,0,Fast Food,Malakpet,Hyderabad,Platter Kebab Combo,BESTSELLER,...,1,46,4.05,171.347826,3.818680,255.954894,3.939031,245.130482,1,0
1,Doner King,3.9,4.2,39,0,Fast Food,Malakpet,Hyderabad,Chicken Rumali Shawarma,BESTSELLER,...,1,46,4.05,171.347826,3.818680,255.954894,3.939031,245.130482,1,0
2,Doner King,3.9,4.2,39,0,Fast Food,Malakpet,Hyderabad,Chicken Tandoori Salad,NONE,...,1,46,4.05,171.347826,3.818680,255.954894,3.939031,245.130482,1,0
3,Doner King,3.9,4.2,39,0,Fast Food,Malakpet,Hyderabad,Chicken BBQ Salad,BESTSELLER,...,1,46,4.05,171.347826,3.818680,255.954894,3.939031,245.130482,1,0
4,Doner King,3.9,4.2,39,0,Fast Food,Malakpet,Hyderabad,Special Doner Wrap Combo,MUST TRY,...,1,46,4.05,171.347826,3.818680,255.954894,3.939031,245.130482,1,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
123652,Ariena Boutique Hotel,3.9,4.2,13,523,Pizza,Purena,Raipur,Murgh Reshmi Kebab,NONE,...,1,286,4.05,354.475524,3.885698,208.939511,3.880503,194.591645,1,1
123653,Ariena Boutique Hotel,3.9,4.2,13,523,Pizza,Purena,Raipur,Murgh Large Tikka,NONE,...,1,286,4.05,354.475524,3.885698,208.939511,3.880503,194.591645,1,1
123654,Ariena Boutique Hotel,3.9,4.2,13,523,Pizza,Purena,Raipur,Murgh Chukandri Tikka,NONE,...,1,286,4.05,354.475524,3.885698,208.939511,3.880503,194.591645,1,1
123655,Ariena Boutique Hotel,3.9,4.2,13,523,Pizza,Purena,Raipur,Murgh Golden Kebab,NONE,...,1,286,4.05,354.475524,3.885698,208.939511,3.880503,194.591645,1,1
123656,Ariena Boutique Hotel,3.9,4.2,13,523,Pizza,Purena,Raipur,Gosht Gilawat Chop,BESTSELLER,...,1,286,4.05,354.475524,3.885698,208.939511,3.880503,194.591645,1,1

123657 rows * 26 columns

In [3]:
zomato['Restaurant_Name'].nunique()

826

In [4]:
zomato['Item_Name'].nunique()

55693

In [5]:
zomato['Cuisine'].nunique()

48

In [6]:
zomato['Place_Name'].nunique()

324

In [7]:
zomato['City'].nunique()

17

# 1. Restaurant Performance Insights

### 1.1 Top restaurants by rating, votes, and delivery

In [8]:
zomato['Average_Rating'] = pd.to_numeric(zomato['Average_Rating'], errors='coerce')
zomato['Votes'] = pd.to_numeric(zomato['Votes'], errors='coerce').fillna(0)

In [9]:
agg = zomato.groupby(['Restaurant_Name', 'Place_Name'], as_index=False).agg({
    'Average_Rating':'mean',   
    'Votes':'sum',
    'Delivery_Rating':'mean',
    'Dining_Rating':'mean'
})

In [10]:
best_restaurant = agg[(agg['Average_Rating']>=4.2) & (agg['Votes']>=10000)].sort_values(by=['Average_Rating', 'Votes'], ascending=[False, False]).head(10)   
best_restaurant

,Restaurant_Name,Place_Name,Average_Rating,Votes,Delivery_Rating,Dining_Rating
864,Truffles,St. Marks Road,4.45,19069,4.3,4.6
509,Meghana Foods,Residency Road,4.35,28875,4.4,4.3
68,Babal Da Punjabi Dabha,Egmore,4.30,11315,4.2,4.4
910,Zam Zam Restaurant,Park Circus Area,4.25,28723,4.3,4.2
648,Puliyogare Point,Basavanagudi,4.25,14594,4.3,4.2
190,Chowman,Hatibagan,4.25,13621,4.1,4.4
209,Dastarkhwan,Kaiserbagh,4.25,12598,4.0,4.5
826,The Grand Thakar,Satellite,4.25,10063,4.2,4.3
726,Shah Ghouse Hotel & Restaurant,Charminar,4.20,31134,4.2,4.2
487,Manju Mamta Restaurant,Jawahar Nagar,4.20,14185,4.2,4.2

In [11]:
best_restaurant_by_del = agg[agg['Delivery_Rating']>=4.2].sort_values(by=['Delivery_Rating', 'Votes'], ascending=[False, False]).head(10)   
best_restaurant_by_del

,Restaurant_Name,Place_Name,Average_Rating,Votes,Delivery_Rating,Dining_Rating
233,Dream Cutlets,Fort Kochi,4.211132,705,4.6,3.822264
769,Subhan Bakery,Nampally,4.250000,96,4.6,3.900000
542,Natural Ice Cream,Connaught Place,4.650000,2287,4.5,4.800000
544,Natural Ice Cream,JM Road,4.350000,2208,4.5,4.200000
534,NIC Ice Creams,Frazer Town,4.161132,1108,4.5,3.822264
71,Balaram Mullick & Radharaman Mullick Sweets,Theatre Road,3.900000,1090,4.5,3.300000
543,Natural Ice Cream,Himayath Nagar,4.161132,1078,4.5,3.822264
785,Swiss Castle,Abids,4.300000,1012,4.5,4.100000
856,Tibb's Frankie - Serving Rolls Since 1969,MPM Mall,4.150000,709,4.5,3.800000
878,Vadilal - Scoop Shop,Ellis Bridge,3.900000,259,4.5,3.300000

### 1.2 Restaurants with highest total votes

In [12]:
best_restaurant_by_votes = agg[agg['Delivery_Rating']>=4.2].sort_values(by=['Votes'], ascending=[False]).head(5)   
best_restaurant_by_votes

,Restaurant_Name,Place_Name,Average_Rating,Votes,Delivery_Rating,Dining_Rating
15,Agarwal Caterers,Shastri Nagar,3.95,116249,4.3,3.6
3,4M Biryani House,Musheerabad,4.15,49363,4.2,4.1
726,Shah Ghouse Hotel & Restaurant,Charminar,4.20,31134,4.2,4.2
509,Meghana Foods,Residency Road,4.35,28875,4.4,4.3
910,Zam Zam Restaurant,Park Circus Area,4.25,28723,4.3,4.2

### 1.3 Compare and analyze the difference between Dining_Rating and Delivery_Rating.

In [13]:
zomato['diff'] = agg['Delivery_Rating'] - agg['Dining_Rating']
zomato['diff']

0         0.000000
1         0.177736
2         0.000000
3         0.100000
4         0.477736
            ...
123652         NaN
123653         NaN
123654         NaN
123655         NaN
123656         NaN
Name: diff, Length: 123657, dtype: float64

In [14]:
restaurant_summary = zomato.groupby('Restaurant_Name')['diff'].mean().reset_index().sort_values(
    by='diff',
    ascending=False).head(10)
restaurant_summary

                  Restaurant_Name      diff
680         Siddique Kabab Centre  0.289113
712                     Taco Bell  0.182357
207                    Doner King  0.160783
656  Shah Ghouse Special Shawarma  0.150169
118                   Burger King  0.146490
714   Taj Mahal - Taj Mahal Hotel  0.145691
186      Crystal Restaurant & Bar  0.133480
110                     BrownBear  0.125302
0                    12 To 12 BBQ       NaN
1                   1441 Pizzeria       NaN

In [15]:
zomato['din_diff'] = agg['Dining_Rating'] - agg['Delivery_Rating']
zomato['din_diff']

0         0.000000
1        -0.177736
2         0.000000
3        -0.100000
4        -0.477736
            ...
123652         NaN
123653         NaN
123654         NaN
123655         NaN
123656         NaN
Name: din_diff, Length: 123657, dtype: float64

In [16]:
restaurant_summary = zomato.groupby('Restaurant_Name')['din_diff'].mean().reset_index().sort_values(
    by='din_diff',
    ascending=False)
restaurant_summary

                  Restaurant_Name  din_diff
110                     BrownBear -0.125302
186      Crystal Restaurant & Bar -0.133480
714   Taj Mahal - Taj Mahal Hotel -0.145691
118                   Burger King -0.146490
656  Shah Ghouse Special Shawarma -0.150169
..                            ...       ...
821        Zaffran Mataam Alarabi       NaN
822               Zam Zam Briyani       NaN
823            Zam Zam Restaurant       NaN
824        Zeeshan Biryani Corner       NaN
825      Zomoz - The Momo Company       NaN

[826 rows x 2 columns]

### 1.4 Determine the quantitative effect of the Best_Seller status.

In [17]:
best_restaurant_bs = agg[(agg['Votes']>=10000) & (zomato['Best_Seller']=='BESTSELLER')].sort_values(by=['Votes'], ascending=[False])   
best_restaurant_bs

C:\Users\HP\AppData\Local\Temp\ipykernel_26960\3042919296.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  best_restaurant_bs = agg[(agg['Votes']>=10000) & (zomato['Best_Seller']=='BESTSELLER')].sort_values(by=['Votes'], ascending=[False])

,Restaurant_Name,Place_Name,Average_Rating,Votes,Delivery_Rating,Dining_Rating
15,Agarwal Caterers,Shastri Nagar,3.950000,116249,4.3,3.600000
83,Bawarchi,RTC X roads,4.150000,90838,4.1,4.200000
3,4M Biryani House,Musheerabad,4.150000,49363,4.2,4.100000
726,Shah Ghouse Hotel & Restaurant,Charminar,4.200000,31134,4.2,4.200000
464,Lucky Multicuisine Restaurant,Somajiguda,4.000000,24500,3.8,4.200000
347,Hotel Shadab,Ghansi Bazaar,4.200000,18502,4.1,4.300000
56,Aromas Of Biryani,Jayanagar,4.100000,15988,4.0,4.200000
760,Sodhani Sweets Pvt. Ltd.,Bapu Nagar,4.111132,11856,4.4,3.822264
46,Apni Rasoi Int,Pandav Nagar,3.700000,11807,3.8,3.600000
129,Burger King,Pink Square Mall,4.000000,11590,4.0,4.000000
198,Cream Stone Ice Cream,Begum Bazaar,4.200000,11562,4.3,4.100000
126,Burger King,Dadar West,3.650000,11330,4.0,3.300000
727,Shah Ghouse Special Shawarma,Charminar,4.200000,10608,4.1,4.300000

### 1.5 Analyse the characteristics of restaurants where Is_Highly_Rated is 1.

What are the common cuisines, price points, and geographical locations for these top-performing restaurants?

In [18]:
common = zomato.groupby(['Restaurant_Name','Cuisine','City'])['Is_Highly_Rated'].mean().reset_index().sort_values(
    by='Is_Highly_Rated',
    ascending=False).head(10)
common

                 Restaurant_Name    Cuisine        City  Is_Highly_Rated
891                      Wafflez      Pizza      Raipur              1.0
888                    WOW! Momo  Beverages   Hyderabad              1.0
885                   WOW! China   Desserts     Kolkata              1.0
31   Alpine Restaurant & Banquet  Beverages   Ahmedabad              1.0
27                       Al Taza  Beverages       Kochi              1.0
26          Al Rabea Mandi House      Mandi   Hyderabad              1.0
19     Al Akbar Fast Food Corner  Beverages   Hyderabad              1.0
876             Ustaad's Kitchen      Pizza      Raipur              1.0
875                Urban Khichdi  Beverages   Ahmedabad              1.0
874                Urban Biryani      Pizza      Raipur              1.0

In [19]:
common = zomato.groupby(['Restaurant_Name','Cuisine','Prices','City'])['Is_Highly_Rated'].mean().reset_index().sort_values(
    by='Is_Highly_Rated',
    ascending=False).head(10)
common

,Restaurant_Name,Cuisine,Prices,City,Is_Highly_Rated
31302,Zomoz - The Momo Company,Fast Food,340.0,Hyderabad,1.0
0,12 To 12 BBQ,Biryani,20.0,Kochi,1.0
1,12 To 12 BBQ,Biryani,25.0,Kochi,1.0
2,12 To 12 BBQ,Biryani,30.0,Kochi,1.0
3,12 To 12 BBQ,Biryani,35.0,Kochi,1.0
4,12 To 12 BBQ,Biryani,40.0,Kochi,1.0
5,12 To 12 BBQ,Biryani,100.0,Kochi,1.0
31286,Zomoz - The Momo Company,Fast Food,165.0,Hyderabad,1.0
31285,Zomoz - The Momo Company,Fast Food,160.0,Hyderabad,1.0
31284,Zomoz - The Momo Company,Fast Food,155.0,Hyderabad,1.0

# 2. City Performance Benchmarking

### 2.1 Identify the city with the highest average restaurant rating

In [20]:
high_avg_city = zomato.groupby('City')['Avg_Rating_City'].mean().reset_index().sort_values(
    by='Avg_Rating_City',
    ascending=False).head(10)
high_avg_city

             City  Avg_Rating_City
11   Malleshwaram         4.000000
13      New Delhi         3.943863
5       Hyderabad         3.939031
16         Ulsoor         3.911132
9         Lucknow         3.909544
8         Kolkata         3.907014
4             Goa         3.898374
6          Jaipur         3.892180
3         Chennai         3.889413
12         Mumbai         3.886635

### 2.2 Identify the city with the highest average food price (Avg_Price_City)

In [21]:
high_avg_price_city = zomato.groupby('City')['Avg_Price_City'].mean().reset_index().sort_values(
    by='Avg_Price_City',
    ascending=False).head(10)
high_avg_price_city

          City  Avg_Price_City
16      Ulsoor      670.242424
1    Banaswadi      335.893299
12      Mumbai      304.402778
3      Chennai      261.863993
5    Hyderabad      245.130482
14        Pune      242.170568
8      Kolkata      239.819348
9      Lucknow      235.550603
13   New Delhi      235.347676
2    Bangalore      233.416551

### 2.3 Which localities show the highest concentration of high-rated or popular restaurants?

In [22]:
high_restau_city = zomato.groupby('City')['Restaurant_Name'].nunique().reset_index()   
high_restau_city.sort_values(by='Restaurant_Name',ascending=False).head(10)

          City  Restaurant_Name
5    Hyderabad              129
6       Jaipur               92
3      Chennai               87
2    Bangalore               81
12      Mumbai               80
0    Ahmedabad               74
7        Kochi               72
8      Kolkata               64
14        Pune               60
9      Lucknow               57

# 3. Pricing and Value Analysis

### 3.1. Analyze the relationship between an item's Average_Rating and its calculated Price_per_Vote.

In [23]:
pricing_and_value_analysis = zomato.groupby('Item_Name')[['Price_per_Vote','Average_Rating']].mean().reset_index().sort_values(
    by='Average_Rating',
    ascending=False)
pricing_and_value_analysis

                                  Item_Name  Price_per_Vote  Average_Rating
29986                   Make your Own Combo      128.955000            4.65
4581   Best of Three Worlds Mini Pack Combo      773.730000            4.65
45967   Signature Mini Pack Chocolate Combo      773.730000            4.65
45968   Signature Mini Pack Dry Fruit Combo      773.730000            4.65
18074                          Dark Belgium        2.531250            4.45
...                                     ...             ...             ...
35988                          Nool Porotta        1.346154            3.00
38631                        Paneer Perattu      280.000000            3.00
33277                            Morre Soda      140.000000            3.00
29374                           Lichi Lassi      154.000000            3.00
27812                        Kerala Porotta        1.866667            3.00

[55693 rows x 3 columns]

### 3.1. Compare the Prices of items with high Votes versus items with low Votes within the same Cuisine and Restaurant_Name.

In [24]:
zomato['Is_Popular'] = zomato['Votes'] > zomato['Votes'].median()

In [25]:
price_comparison = zomato.groupby(['Cuisine', 'Is_Popular'])['Prices'].mean().reset_index().head(10)
price_comparison

    Cuisine  Is_Popular      Prices
0  American       False  258.800797
1  American        True  236.058333
2    Andhra       False  639.160000
3    Andhra        True  316.186275
4    Awadhi       False  242.500000
5    Awadhi        True  198.555556
6    Bakery       False  298.137657
7    Bakery        True  190.460391
8       Bbq       False  251.536383
9       Bbq        True  252.829060

### 3.2. Analyze the attributes of restaurants where the Is_Expensive column is 1.

In [26]:
Expensive_prices = zomato.groupby('Is_Expensive')['Prices'].mean().reset_index().head(10)
Expensive_prices

   Is_Expensive      Prices
0             0  169.639861
1             1  464.297814

In [27]:
Expensive_cuisine = zomato.groupby('Is_Expensive')['Avg_Price_Cuisine'].mean().reset_index().head(10)
Expensive_cuisine

   Is_Expensive  Avg_Price_Cuisine
0             0         238.306751
1             1         250.923196

In [28]:
Expensive_cuisine = zomato.groupby('Is_Expensive')['Restaurant_Popularity'].mean().reset_index().head(10)
Expensive_cuisine

   Is_Expensive  Restaurant_Popularity
0             0             287.966895
1             1             353.854514

# 4. Cuisine Analysis

### 4.1. Rank all Cuisine types based on the highest total Total_Votes across all restaurants (Cuisine Popularity Ranking).

In [29]:
most_voted_cuisine = zomato.groupby('Cuisine')['Total_Votes'].sum().reset_index().sort_values(by='Total_Votes',ascending=False).head(10)
most_voted_cuisine

         Cuisine  Total_Votes
5      Beverages     11593070
11      Desserts      3451867
31         Pizza      3400439
12     Fast Food      3351066
39       Sichuan      2000256
8        Chinese      1428648
6        Biryani      1030806
29  North Indian       872173
41   Street Food       671625
40  South Indian       484761

### 4.2. Rank all Cuisine types based on their calculated Avg_Rating_Cuisine (Cuisine Quality Ranking).

In [30]:
most_rated_cuisine = zomato.groupby('Cuisine')['Avg_Rating_Cuisine'].mean().reset_index().sort_values(by='Avg_Rating_Cuisine',ascending=False).head(10)
most_rated_cuisine

         Cuisine  Avg_Rating_Cuisine
1         Andhra            4.250000
2         Awadhi            4.250000
42           Tea            4.111132
45       Turkish            4.100000
3         Bakery            4.069201
25       Mexican            4.063223
36       Seafood            4.047593
14  Healthy Food            4.011132
34         Salad            4.001790
44       Tibetan            4.000000

### 4.3. Compare the Avg_Price_Cuisine to understand which cuisine types are, on average, the most and least expensive (Cuisine Pricing Analysis).

In [31]:
most_priced_cuisine = zomato.groupby('Cuisine')['Avg_Price_Cuisine'].mean().reset_index().sort_values(by='Avg_Price_Cuisine',ascending=False).head(10)
most_priced_cuisine

        Cuisine  Avg_Price_Cuisine
46   Vietnamese         512.500000
22     Lucknowi         384.209302
1        Andhra         379.763780
10  Continental         349.923944
43         Thai         336.500000
20        Kebab         318.322826
36      Seafood         296.597212
33        Rolls         273.985376
25      Mexican         270.700000
6       Biryani         266.881510

In [32]:
least_priced_cuisine = zomato.groupby('Cuisine')['Avg_Price_Cuisine'].mean().reset_index().sort_values(by='Avg_Price_Cuisine',ascending=True).head(10)
least_priced_cuisine

          Cuisine  Avg_Price_Cuisine
42            Tea          61.428571
23  Maharashtrian         129.370056
21         Kerala         144.842520
19    Kathiyawadi         157.370748
38       Shawarma         164.525510
44        Tibetan         169.000000
41    Street Food         170.564668
18         Juices         187.206999
16      Ice Cream         187.315722
9          Coffee         187.788874

In [33]:
coeff = zomato['Price_per_Vote'].corr(zomato['Average_Rating'])
coeff

np.float64(-0.015940677755971598)

In [36]:
zomato.to_excel('zomato_cleaned.xlsx', index=False)